V7R175/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

//Domain length in x-direction
x1   -0.035;
x2    0.035;
//Number of cells in x-direction
nx   14;

//Domain limits in y-direction
y1    -0.04;
y2     0.06;
//Number of cells in y-direction
ny   20;

//Domain length in z-direction
z1    -0.035;
z2     0.035;
//Number of cells in z-direction
nz    14;

vertices
(
    ($x1 $y1 $z1)
    ($x2 $y1 $z1)
    ($x2 $y2 $z1)
    ($x1 $y2 $z1)
    ($x1 $y1 $z2)
    ($x2 $y1 $z2)
    ($x2 $y2 $z2)
    ($x1 $y2 $z2)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) ($nx $ny $nz) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    left
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
    right
    {
        type patch;
        faces
        (
            (1 2 6 5)
        );
    }
    back
    {
        type patch;
        faces
        (
            (4 5 6 7)
        );
    }
    front
    {
        type patch;
        faces
        (
            (0 3 2 1)
        );
    }
    top
    {
        type patch;
        faces
        (
            (0 1 5 4)
        );
    }
    bottom
    {
        type patch;
        faces
        (
            (2 3 7 6)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
